---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilyManager..::..IsUserAssignableParameterGroup Method
FamilyManager Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IsUserAssignableParameterGroup(BuiltInParameterGroup) | **Obsolete.** Checks if the given parameter group can be assigned to new parameters. |
|  | IsUserAssignableParameterGroup(ForgeTypeId) | Checks if the given parameter group can be assigned to new parameters. |

# See Also

FamilyManager Class

FamilyManager Members

Autodesk.Revit.DB Namespace